Revit 2024 API
DoubleArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual DoubleArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As DoubleArrayIterator
Visual C++
public:
virtual DoubleArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
DoubleArray Class
Autodesk.Revit.DB Namespace